GET INSPIRED
Planning a trip and being on the road is a lot easier than you think. Its the decision to take that step out the door that is the hardest part. It requires the  most change. You are leaving your old life behind for a new one.

SAVE MONEY FOR ANY TRIP
The key to any trip is being smart with your money and that starts even before you hit the road! Its important to know how to save and plan your trip so you dont find
yourself running out of money on the road. Here are my best tips and tricks on how to save money for any trip -even if you dont make a ton of money. Ive found tons of ways to compound your savings and get on the road faster!

HOW TO PLAN YOUR TRIP
Planning your trip can be a lot of work! Where do you start? Whats step one? Whats step two? Whats step three? Fret not! This page will give you all the best resources I have for planning your trip from start to finish. These posts go into the nuts and bolts of planning. They will teach you what to do first, second, and third. They will teach you how to narrow down your travel choices, know where to get legit information on the web (besides here), and help you avoid the newbie mistakes I made in the beginning!

GET THE RIGHT GEAR
Outside a few key things, I dont think travelers dont need a lot of gear when they travel (unless youre hiking and camping). The more you carry, the more youre weighed down. However, since gear is expensive, making a mistake or two can lead you to wasting money, buying the wrong gear, or traveling with too much stuff. This section will teach you how to buy the right backpack, what to pack, protect your
data and teach, and give you some other advanced tips and tricks for the road!

HOW TO GET CHEAP AIRFARE
Looking for a cheap flight? The cost of airfare is one of the main reasons people dont travel more. However, thanks to the rise of international budget airlines and deal finding websites, its gotten a lot easier to fly around the world on the cheap!

GET ACCOMMODATION
Accommodation will be one of your biggest daily expenses and lowering that cost can lead to huge savings. To a lot of people, the choice seems to be either expensive hotels or cheap hostel dorms. But there are many other options available to travelers whether you are a solo traveler, couple, or family. These articles will help choose the right accommodation for you, find the best deals, avoid being
scammed, and break out of the hotel/hostel mold.

HANDLE LIFE ON THE TRIP
Long-term travel is one of the most exciting, interesting, and learning experiences a person can do in their lifetime. It makes you a far more well-adjusted person, more open-minded, more independent, and more confident.


